from .. import Provider as CompanyProvider


class Provider(CompanyProvider):
    """Afghanistan companies in Pashto."""

    company_suffixes = ("شرکت", "ليمیټډ", "مؤسسه", "ګروپ", "تولیدي شرکت", "سوداګریز شرکت")

    companies = (
        "افغان ټېلېکام",
        "افغان بېسیم مخابرات شرکت",
        "روشان ټېلېکام",
        "عزیزی بانک",
        "بانک-ای-ملي افغان",
        "د افغانستان بانک",
        "لومړی مایکروفایننس بانک",
        "آریانا افغان هوايي شرکت",
        "کام ایر",
        "شرق افق هوايي شرکت",
        "خیبر افغان هوايي شرکت",
        "موبي رسنۍ ګروپ",
        "پژواک افغان خبري آژانس",
        "آریانا تلویزیون",
        "نوی کابل بانک",
        "پښتني بانک",
        "بغلان بوره فابریکه",
        "بیات بریښنا شرکت",
        "الکوزی ګروپ",
        "سلام افغان ټېلېکام",
        "اېټوما ټېلېکام",
    )

    def company(self):
        return self.generator.random.choice(self.companies)
